Public Member Functions | List of all members
API_IGraphisoftIDEventHandler Class Referenceabstract
Notifications Manager
#include <APIdefs_Callback.h>
 Inheritance diagram for API_IGraphisoftIDEventHandler:
 Public Member Functions
virtual GS::UniString  | GetName () const override final
virtual void  | Dispatch (const API_IEventNotifier &eventNotifier) const override final
It dispatches the event.
 virtual void  | OnUserChanged () const =0
Event handler for Graphisoft ID changes.
virtual GS::UniString  | GetName () const =0
virtual void  | Dispatch (const API_IEventNotifier &eventNotifier) const =0
It dispatches the event.
Detailed Description
The base class you need to inherit from in case you want to handle Graphisoft ID change event.
Since
Archicad 26
Member Function Documentation
◆ Dispatch()
 virtual void API_IGraphisoftIDEventHandler::Dispatch  |  ( |  const API_IEventNotifier &  |  eventNotifier | ) |   const
inlinefinaloverridevirtual
It dispatches the event.
Parameters
eventNotifier | The occurrence of an event can be notified via this parameter.
Implements API_IEventHandler.
◆ GetName()
 virtual GS::UniString API_IGraphisoftIDEventHandler::GetName  |  ( |   | ) |   const
inlinefinaloverridevirtual
Returns
Human readable name of the event handler.
Implements API_IEventHandler.